Repository: dn1lk/d1pq-tg
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Write a request together with command in one message. For example: <code>/{command} {args}</code>
ru: Напиши запрос вместе с командой одним сообщением. Например: <code>/{command} {args}</code>

source: I am a text generator bot and in some cases a great conversationalist. If you write me a message or a command, something might happen.
ru: Я бот, генерирующий сообщения и в некоторых случаях отличный собеседник. Если мне написать сообщение или команду, что-то может произойти.

source: List of my main commands - I only accept them together with the required request, in one message:
ru: Список моих основных команд - я их принимаю только вместе с необходимым запросом, одним сообщением:

source: I choose {choice}.
ru: Я выбираю {choice}.

source: What to choose?
ru: Что выбрать?

source: {args[0]} or {args[1]}
ru: {args[0]} или {args[1]}

source: This command only works in <b>chats</b>, alas =(
ru: Эта команда работает только в <b>чатах</b>, увы =(

source: Hmmm, I think
ru: Хммм, я думаю, что

source: I guess
ru: Я предполагаю, что

source: Oh, I admit
ru: Ох, я догадываюсь, что

source: Maybe it's
ru: Может быть это

source: Wait! It's
ru: Подожди! Это

source: Oh, I don't know you guys... Give me a time.
ru: Ох, я не знаю вас ребят... Дайте мне время.

source: <b>This command requires permission to record chat participants.</b> /settings - give permission.
ru: <b>Для этой команды требуется разрешение записи участников чата.</b> /settings - дать разрешение.

source: Who???
ru: Кто???

source: Ha! Invalid request, try again.
ru: Ха! А вот и нет, попробуй ещё.

source: Luck is clearly NOT in your favor. You didn't guess the game!
ru: Удача явно тебе НЕ благоволит. Ты не угадал игру!

source: The game is not recognized. I'll give it another try!
ru: Игра не распознана. Даю ещё попытку!

source: And here it is not. This game has a different name ;).
ru: А вот и нет. У этой игры другая команда ;).

source: <b>And what do you want to play?</b> Try to guess the game by writing the right words right after the command.
ru: <b>И во что же ты хочешь поиграть?</b> Попробуй угадать игру, написав нужный запрос сразу после команды.

source: Hm, {args}? Ok, I need to think...
ru: Хм, {args}? Ох, мне нужно подумать...

source: Let's do it sooner!
ru: Давай покороче!

source: So what's the question?
ru: Так какой вопросик?

source: history
ru: история

source: In short, {query}
ru: Короче, {query}

source: {user}, hello!
ru: {user}, привет!

source: Hey, {user}.
ru: Привет, {user}.

source: Nice to meet you, {user}.
ru: Рад встрече, {user}

source: My appreciate, {user}.
ru: Моё почтение, {user}

source: Yop, {user}
ru: Йеп, {user}!

source: Victory for me.
ru: Победа за мной.

source: I am a winner.
ru: Я - победитель.

source: I am the winner in this game.
ru: Я оказываюсь победителем в этой игре.

source: You know I won't play with you! Maybe...
ru: Знаешь, я не буду с тобой играть! Возможно...

source: Well don't play with me!
ru: Ну и не играй со мной!

source: I thought we were playing...
ru: Я думал мы играли...

source: It's too slow, I won't play with you!
ru: Я не буду играть с тобой!

source: You already in the game.
ru: Ты уже в игре!

source: Already 10 people are playing in the game. Just wait.
ru: Уже 10 человек играют в игру. Просто подожди.

source: {user} join to current game.
ru: {user} присоединяется к текущей игре.

source: <b>Let's play UNO?</b> One minute to make a decision! Difficulty: {difficulty}. Mode: {mode}. <b>Already in the game:</b> {user}
ru: <b>Сыграем в UNO?</b> Минута на принятие решения! Сложность: {difficulty}. Режим: {mode}. <b>Уже в игре:</b> {user}

source: Oh, the game of cities. Well, let's try! The rules are as follows: you need to answer the name of the settlement, starting with the last letter of the name of the previous settlement. You have 60 seconds to think.
ru: О, игра в города. Ну давай попробуем! Правила такие: нужно ответить название населённого пункта, начинающееся на последнюю букву названия предыдущего населённого пункта. На раздумья - 60 секунд.

source: I start! My word: {bot_var}.
ru: Я начинаю! Моё слово: {bot_var}.

source: You start! Your word?
ru: Ты начинаешь! Твоё слово?

source: Hmm, you are trying your luck... Well, ender any number between 1 and 10 and I'll choose my own and we find out if our thoughts are the same ;).
ru: Мм, ты испытываешь свою удачу... Хорошо, введи любое число от 1 до 10 - а я выберу своё и мы узнаем, совпадают ли наши мысли ;).

source: Mm, {user} is trying his luck... Well, EVERYONE, EVERYONE, EVERYONE, pay attention! Enter any number between 1 and 10 and I'll choose my own in 60 seconds and we'll see which one of you is right.
ru: Мм, {user} испытывает свою удачу... Ну что же, ВСЕ, ВСЕ, ВСЕ, внимайте! Введите любое число от 1 до 10 - а я через 60 секунд выберу своё и мы узнаем, кто из вас окажется прав.

source: LET THE BATTLE BEGIN!
ru: ДА НАЧНЁТСЯ ЖЕ БИТВА!

source: So, my variant is {bot_var}.
ru: Итак, моё число - {bot_var}.

source: This time the title of winner goes to: {winners}. Congratulations!
ru: Что ж... звание победителя достаётся: {winners}. Поздравим же!

source: Well... no one guessed right. Heh.
ru: Что ж... никто не угадал. Хе.

source: Eh, classic. {user}, your turn.
ru: Ех, классика. {user}, твой ход.

source: Yes
ru: Да

source: No
ru: Нет

source: Settings
ru: Настройки

source: LET'S PLAY!
ru: НАЧАТЬ ИГРУ!

source: Back
ru: Назад

source: Bluff!
ru: Блеф!

source: Show cards
ru: Показать карты

source: Ok, so... My choice is {bot_var}.
ru: Итак... Мой выбор {bot_var}.

source: Our numbers matched!
ru: Наши числа совпали!

source: Our numbers don't match =(.
ru: Наши числа не совпали =(.

source: You have already made your choice.
ru: Ты уже выбрал свой вариант.

source: Cunning, but you already used your try.
ru: Хитро, но ты уже использовал свою попытку.

source: So let's write it down ... Seen in a scam.
ru: Так и запишем... Замечен в жульничестве.

source: Your choice has been accepted.
ru: Твой вариант принят.

source: Do you really think that I will choose THIS number? Well, let's see ;).
ru: Ты действительно думаешь, что я выберу ЭТО число? Ну посмотрим ;).

source: So let's write...
ru: Так и запишем...

source: So you won’t guess for sure, choose a emoji from 1 to 10!
ru: Так ты точно не угадаешь, выбери число от 1 до 10!

source: Somebody can't read. It was clearly written, from 1 to 10!
ru: Кто-то не умеет читать. Было чётко написано, от 1 до 10!

source: Between 1 and 10, what's so difficult?!
ru: От 1 до 10, что сложного то?!

source: Rock
ru: Камень

source: Scissors
ru: Ножницы

source: Paper
ru: Бумага

source: draw.
ru: ничья.

source: my win!
ru: моя победа!

source: my defeat...
ru: моё поражение...

source: Score: {loses}-{wins}. Play again?
ru: Счёт: {loses}-{wins}. Сыграем ещё раз?

source: Your choice: {user_var}
ru: Твой выбор: {user_var}

source: Hmm.
ru: Хмм.

source: And you're smarter than you look.
ru: А ты умнее, чем кажешься.

source: Right!
ru: Верно!

source: My word: {bot_var}.
ru: Моё слово: {bot_var}.

source: Okay, I have nothing to write on {letter}... Victory is yours.
ru: Ладно, мне нечего написать на {letter}... Победа за тобой.

source: Can't find the right something on {letter}... My defeat.
ru: Не могу найти нужное название на {letter}... Моё поражение.

source: VICTORY... yours. I can't remember that name... You know, it also starts with {letter}...
ru: ПОБЕДА... твоя. Не могу вспомнить то название... Знаешь, оно ещё начинается на {letter}...

source: We have already used this name. Choose another!
ru: Мы уже использовали это название. Выбери другое!

source: I remember exactly that we already used this. Let's try something else.
ru: Я точно помню, что мы уже использовали это. Попробуй что-нибудь ещё.

source: But no, you can’t fool me - this name was already in the game. Be original!
ru: А нет, ты меня не проведёшь - это название уже было в игре. Будь оригинальнее!

source: I do not understand something or your word is WRONG!
ru: Либо я что-то не понимаю, либо твоё слово НЕВЕРНО!

source: And here it is not. Think better, user!
ru: А вот и нет. Думай лучше, пользователь!

source: My algorithms do not deceive me - you are mistaken!
ru: Мои алгоритмы меня не обманывают - ты ошибся!

source: <b>Remaining attempts</b>: {fail_amount}
ru: <b>Осталось попыток</b>: {failed}

source: You have no attempts left.
ru: У тебя не осталось попыток.

source: Looks like all attempts have been spent.
ru: Похоже, все попытки истрачены.

source: Where is an ordinary user up to artificial intelligence. All attempts have ended.
ru: Куда простому пользователю до искусственного интеллекта. Все попытки закончились.

source: <b>Number of words guessed</b>: {words}.
ru: <b>Количество угаданных слов</b>: {words}.

source: Take a card.
ru: Беру карту.

source: Yes, I play too!
ru: Да-да, я тоже играю!

source: I'll play with you.
ru: Сыграю с вами.

source: I'm with you.
ru: Я с вами.

source: Only {user} can start the game.
ru: Только {user} может начать эту игру.

source: You are already in the list!
ru: Ты уже в списке!

source: The number of players is already 10 people. I can't write anymore.
ru: Количество игроков уже 10 человек. Я не могу записать больше.

source: Now there are one more players!
ru: Теперь участников стало на один больше!

source: Nobody wants to play =(.
ru: Никто не хочет играть =(.

source: And who is there to play with?
ru: А с кем играть-то? =).

source: Now there is one less player!
ru: Теперь участников стало на один меньше!

source: You are not in the list yet!
ru: Ты ещё не в списке!

source: Join to the game.
ru: Присоединиться к игре.

source: Start a new game.
ru: Начать новую игру.

source: slowpoke
ru: слоупок

source: common man
ru: обыватель

source: genius
ru: гений

source: fast
ru: быстрый

source: with points
ru: с очками

source: Only {user} can customize the game.
ru: Только {user} может настраивать эту игру.

source: Of course, I don't mind, but now it's {user}'s turn. We'll have to wait =).
ru: Я, конечно, не против, но сейчас очередь {user}. Придётся подождать =).

source: {user} changes the color to {color}!
ru: {user} меняет цвет на {color}!

source: When you'll get a black card, choose this color ;)
ru: Когда получишь чёрную карту, выберешь этот цвет ;)

source: You see right through people!
ru: Ты видишь людей насквозь!

source: Only {user} can verify the legitimacy of using this card.
ru: Только {user} может проверить легитимность использования этой карты.

source: On reaction =).
ru: На реакции =).

source: Yep!
ru: Ага!

source: Ok, you won't get cards.
ru: Ок, ты не получишь карты.

source: Good job!
ru: Хорошая работа!

source: And you don't want to lose =)
ru: А ты не хочешь проиграть =)

source: You will be reminded of it.
ru: Тебе это припомнят.

source: You are not in the game!
ru: Ты не в игре!

source: Current color: {color}
ru: Текущий цвет: {color}

source: Time is over.
ru: Твоё время вышло.

source: Kick a player from the game?
ru: Исключить игрока из игры?

source: No, keep playing
ru: Нет, продолжить игру

source: I choice {color}.
ru: Я выбираю {color} цвет.

source: My move is made.
ru: Мой ход сделан.

source: Expected? But I don't care.
ru: Ожидали? А мне всё равно.

source: On a scale of 10, rate the quality of this move. Where 0 is very good, 10 is excellent.
ru: Оцените по 10 бальной шкале качество этого хода. Где 0 - очень хороший, 10 - великолепный.

source: I still have cards in my hand.
ru: У меня ещё есть карты в колоде.

source: Curious, but I know all the hands in the game... I dealt them.
ru: Любопытно, а ведь я знаю все карты в игре... Я же их раздавал.

source: Maybe I can even win this game!
ru: Может, у меня получится даже выиграть эту игру!

source: Oh, I don't envy the next player...
ru: Ох, не завидую я следующему игроку...

source: Br-b. Ah. Yes. No. ...
ru: Бр-б. Аа. Да. Нет. ...

source: Oh-oh, this card fell into this chat by itself...
ru: Ой-ой, эта карта сама выпала в этот чат...

source: Blue
ru: Синий

source: Green
ru: Зелёный

source: Red
ru: Красный

source: Yellow
ru: Жёлтый

source: Black
ru: Чёрный

source: The first card is discarded.
ru: Первая карта сброшена.

source: {user} gifts player {uno_user} 2 cards.
ru: {user} дарит игроку {uno_user} 2 карты!

source: {user} gives player {uno_user} 2 cards.
ru: {user} даёт игроку {uno_user} 2 карты!

source: {user} presents player {uno_user} with 2 cards.
ru: {user} преподносит игроку {uno_user} 2 карты!

source: {user} is kicked from the game for kick out of this chat.
ru: {user} исключается из игры за исключение из чата.

source: {user} is kicked from the game.
ru: {user} исключается из игры.

source: Well, I have run out of my hand. I have to remain only an observer =(.
ru: Так-с, у меня закончились карты. Вынужден остаться лишь наблюдателем =(.

source: {user} puts his last card and leaves the game as the winner.
ru: {user} кладёт свою последнюю карту и выходит из игры победителем.

source: {user}, your turn.
ru: {user}, твоя очередь.

source: {user}, your move.
ru: {user}, твой ход.

source: Now {user} is moving.
ru: Сейчас ходит {user}.

source: Player's turn {user}.
ru: Очередь игрока {user}.

source: I pass the turn to the player {user}.
ru: Передаю очередь игроку {user}.

source: WINNER
ru: ПОБЕДИТЕЛЬ

source: card played
ru: сыграна карта

source: point earned
ru: заработан балл

source: Game over.
ru: Игра окончена.

source: Round over.
ru: Раунд окончен.

source: What a joke, this card is not from your hand, {user}.
ru: Что за шутка, эта карта не из твоей колоды, {user}.

source: {user} doesn't want to take cards.
ru: {user}, не хочет брать карты.

source: What a heat, +2 to the queue!
ru: Какой накал, +2 в очередь!

source: {user}, calm down and take the cards!
ru: {user}, смирись и возьми карту!

source: Black card by {user}!
ru: Чёрная карта by {user}!

source: So... {user}.
ru: Так-с... {user}.

source: Wow, you got {color}!
ru: Вау, у тебя был {color} цвет!

source: {user} changes color!
ru: {user} меняет цвет!

source: {user}, attempt not counted, get a card! =).
ru: {user}, попытка не засчитана, бери карту! =).

source: Just. Skip. Turn.
ru: Просто. Пропусти. Ход.

source: Someday {user} will be able to make the right turn.
ru: В один прекрасный день {user} сделает правильный ход.

source: {user}, you're in luck!
ru: {user}, а тебе везёт!

source: {user}, is that honest?
ru: {user}, а это по правилам?

source: No, this card is wrong. Take another one!
ru: Нет, это карта неправильная. Бери ещё одну!

source: {user} is unskippable!
ru: {user} невозможно пропустить!

source: {user}, you can't be skipped!
ru: {user}, тебя нельзя пропустить!

source: Skips are not for you =).
ru: Пропуски не для тебя =).

source: {user}, your turn is skipped =(.
ru: {user}, твой ход пропущен =(.

source: {user} keeps throwing cards...
ru: {user} продолжает накидывать карты...

source: {user}, will anyone stop you?
ru: {user}, кто-нибудь остановит тебя?

source: {user}, you have already made your turn.
ru: {user}, твой ход уже был сделан.

source: We've been interrupted!
ru: В игру врывается {user}!

source: I bet {user} will win this game!
ru: Держу пари, {user} выиграет эту игру!

source: Suddenly, {user}.
ru: Внезапно, {user}.

source: Hold your horses, {user}. Now is not your turn.
ru: Попридержи коней, {user}. Сейчас не твой ход.

source: Hey, {user}. Your card doesn't belong this turn.
ru: Хей, {user}. Твоей карте не место на этом ходу.

source: No. No no no. No. Again, NO!
ru: Нет. Нет, нет, нет. Нет. Ещё раз, НЕТ!

source: Someone explain to {user} how to play.
ru: {user}, спроси ты у кого-нибудь, как играть.

source: Can I just give {user} a card and we'll pretend like nothing happened?
ru: Давай я просто дам игроку {user} карту и мы сделаем вид, что ничего не было?

source: I'm betting on {user}'s defeat.
ru: Делаю ставку на поражение игрока {user}.

source: {user} has one card left!
ru: У игрока {user} осталась одна карта!

source: Finally, we will change the color. What will {user} choose?
ru: Наконец мы поменяем цвет. Что выберет {user}?

source: New color, new light. by {user}.
ru: Новый цвет, новый свет. by {user}.

source: How cruel!
ru: Как жестоко!

source: What a surprise.
ru: Вот это сюрприз.

source: {user} is clearly taking revenge... +
ru: {user} определённо осуществляет месть... +

source: {user} sends a fiery hello and
ru: {user} шлёт пламенный привет и

source: a card!
ru: карту!

source: Is this card legal?
ru: А эта дикая карта легальна?

source: A wild card... one that can be thrown illegally!
ru: Дикая карта... такая может быть нелегальна!

source: Will the next player dare to check such a turn...
ru: Осмелится ли следующий игрок проверить карту...

source: And vice versa!
ru: И всё наоборот!

source: A bit of a mess...
ru: Немного беспорядка...

source: {user} changes the queue.
ru: {user} меняет очередь.

source: {user} loses a turn?
ru: {user} лишается хода?

source: {user} risks missing a turn.
ru: {user} рискует пропустить ход.

source: {user} can forget about the next turn.
ru: {user} может забыть о следующем ходе.

source: {user} receives
ru: {user} получает

source: a card.
ru: карту.

source: Bluff! I see suitable cards, not only wilds.
ru: Блеф! Я вижу подходящие карты, не только дикую.

source: Ah, no. I decided to check you and there were no suitable cards =(
ru: Ох, нет. Я решил проверить тебя и у тебя не оказалось других подходящих карт =(

source: Nope. It is not bluff.
ru: Неа. Это не блеф.

source: Shhh, this card was legal.
ru: Шшш, эта карта была легальна.

source: I also thought that this card does not belong here. But only it is suitable...
ru: Я тоже думал, что этой карте здесь не место. Но она подходит...

source: Update:
ru: Обновить:

source: Update again:
ru: Обновить ещё раз:

source: Text generation accuracy updated successfully: {accuracy}.
ru: Точность генерации текста успешно обновлена: {markov_state}.

source: Current text generation accuracy: {accuracy}. The larger the value, the more accurate, but the text generation will take longer.
ru: Текущая точность генерации текста: {accuracy}. Чем больше значение - тем точнее, но дольше будет осуществляться генерация текста.

source: The chance of text generation has reached the limit: {chance}%, below is impossible.
ru: Шанс генерации текста достиг лимит: {chance}%, ниже нельзя.

source: The chance of text generation has reached the limit: {chance}%, higher is impossible.
ru: Шанс генерации текста достиг лимит: {chance}%, выше нельзя.

source: Text generation chance successfully updated: {chance}%.
ru: Шанс генерации текста успешно обновлён: {chance}%.

source: Current text generation chance: {chance}%.
ru: Текущий шанс генерации текста: {chance}%.

source: The record was successfully deleted.
ru: Данные успешно удалены.

source: {item} record is {status}.
ru: Запись {item} {status}.

source: enabled
ru: включена

source: disabled
ru: отключена

source: Messages
ru: сообщений

source: Members
ru: участников

source: I am record some information about this chat.
ru: Я записываю некоторую информацию об этом чате.

source: for more accurate and relevant message generation
ru: для более точной и релевантной генерации сообщений

source: to execute /who command
ru: для выполнения команды /who

source: - <b>{item} record</b> - {description}.
ru: - <b>Запись {item}</b> - {description}.

source: Add command
ru: Добавить команду

source: Change language
ru: Изменить язык

source: Change generation chance
ru: Изменить шанс генерации

source: Change generation accuracy
ru: Изменить точность генерации

source: Change record policy
ru: Изменить политику данных

source: {action} {item} record
ru: {action} запись {item}

source: Enable
ru: Включить

source: Disable
ru: Отключить

source: Delete all record
ru: Удалить все данные

source: <b>The language has been successfully updated.</b> Already the next message will be in the language: {locale}.
ru: <b>Язык успешно обновлён.</b> Уже следующее сообщение будет на языке: {locale}.

source: <b>Update bot language.</b> Current language: <b>{locale}</b>. Available languages:
ru: <b>Обновить язык бота.</b> Текущий язык: <b>{locale}</b>. Доступные языки:

source: dialogue
ru: диалога

source: chat - only for {admins}
ru: чат - только для {admins}

source: only I don't know who it is... So
ru: только я не знаю, кто это... Итак

source: My settings for this {chat}:
ru: Мои настройки для этого {chat}:

source: Only for administrators.
ru: Только для администраторов.

source: <b>Tired of writing preset commands?</b>{no_args} - and I will answer this command.
ru: <b>Надоело мне писать предустановленные команды?</b>{no_args} - и я буду отвечать на эту команду.

source: missing.
ru: отсутствуют.

source: Current custom commands:
ru: Текущие кастомные настройки:

source: The /{args} command is already in my database. Try another.
ru: Команда /{args} уже есть в моей базе. Попробуй ещё.

source: <b>Command /{args} added successfully!</b> Now in this chat you can write it instead of the /{command} command.
ru: <b>Команда /{args} успешно добавлена!</b> Теперь в этом чате можно писать её вместо команды /{command}.

source: No, I can record only one custom command. You'll have to choose!
ru: Нет, я могу записать только одну кастомную команду. Придётся выбирать!

source: <b>Custom command not recognized.</b>
ru: <b>Кастомная команда не распознана.</b>

source: <b>Default command not recognized.</b> /settings - repeat the procedure.
ru: <b>Предустановленная команда не распознана.</b> /settings - повторить процедуру.

source: Ouch, it's just a migrated group...
ru: Оуч, это просто мигрированная группа...

source: {chat}, we are together again!
ru: {chat}, мы снова вместе!

source: {chat}, don't kick me anymore =(
ru: {chat}, не кикайте меня больше =(

source: However hello, {chat}!
ru: И вновь привет, {chat}!

source: {chat}, hello! Let's start with answering the obvious questions: - What am I? Bot. - What can I do? Some things after which something happens...
ru: {chat}, привет! Начну с ответа на типичные вопросы: - Что я есть? Бот. - Что я могу? Некоторые вещи, после которых что-то происходит...

source: All bacchanalia, with you {user}!
ru: Всем вакханалия, с вами {user}!

source: You don't have to clap, {user} is with us.
ru: Можете не хлопать, {user} теперь с нами.

source: Do not meet, now we have {user}!
ru: Не встречайте, с нами {user}!

source: Greetings, {user}!
ru: Приветствую, {user}!

source: Welcome, {user}!
ru: Добро пожаловать, {user}!

source: {user}... Who is it?
ru: {user}... А кто это?

source: Ha, and so be it!
ru: Ха, так и надо!

source: Nothing to chat here.
ru: Нечего писать тут.

source: Bye-bye.
ru: Пока-пока.

source: I'll miss :(.
ru: Я буду скучать :(.

source: We've lost a great man... Wait, was that a man?
ru: Мы потеряли замечательного человека... Стоп, это был человек?

source: Let's remember.
ru: Мы будем помнить.

source: Get out of here, user!
ru: Ну и иди отсюда, пользователь!

source: And it all started so nicely...
ru: А всё начиналось так прекрасно...

source: I am with you again, {user}!
ru: И снова здравствуйте, с вами {user}!

source: {user}, I got out of your anger?
ru: {user}, я вышел из твоего гнева?

source: I returned, {user}!
ru: Я вернулся, {user}!
